def caching_fibonacci(): # Створення функції
    cache = {0:0,1:1} # Ініціалізуємо кеш-словник з двома першими елементами

    def fibonacci(n): # Створюємо вкладену функцію для обчислення n-го числа
        if n not in cache: # Перевіряємо наявність числа в кеші
            cache[n] = fibonacci(n - 1) + fibonacci(n - 2) # Якщо відсутнє - виконуємо обчислення
        return cache[n] # Повертаємо результат обчислення

    return fibonacci # Повертаємо результат роботи вкладеної функції

fib = caching_fibonacci() # Ініціалізуємо змінну, значенням якої буде результат роботи функції

print(fib(15))  # Виведе 610
print(fib(10))  # Виведе 55
print(fib(8))
print(fib(5))
